In [1]:
import pandas as pd
data = {
'name': ['John', 'Jane', 'Sam', 'Sara', 'Alex', 'David', 'Emily', 'Frank',
'Grace', 'Hannah',
'Ivy', 'Jack', 'Luke', 'Mia', 'Nina', 'Oliver', 'Paul', 'Quincy',
'Rachel', 'Sophia',
'Tom', 'Ursula', 'Victor', 'Walter', 'Xander', 'Yara'],
'department': ['HR', 'IT', 'HR', 'Sales', 'HR', 'IT', 'Sales', 'Sales', 'HR',
'IT',
'Sales', 'HR', 'Sales', 'IT', 'HR', 'Sales', 'IT', 'Sales', 'HR',
'Sales',
'IT', 'HR', 'Sales', 'HR', 'IT', 'Sales'],
'salary': [5000, 7000, 6000, 4500, 5500, 8000, 7000, 6000, 5000, 4000,
6500, 6000, 5500, 7500, 4500, 7000, 8000, 6500, 5500, 6500,
5000, 7500, 6000, 5500, 7000, 6500]
}

# Using list comprehension, find names of employees who earn more than 7000

In [2]:
df=pd.DataFrame(data)

d= [df['name'][x] for x in range(len(df['salary'])) if df['salary'] [x] >7000]

print('the employees who earn >7000\n',d)

the employees who earn >7000
 ['David', 'Mia', 'Paul', 'Ursula']

# Find employees from 'IT' department using .loc

In [3]:
a=df[df['department']=='IT']
print(a)

      name department  salary
1     Jane         IT    7000
5    David         IT    8000
9   Hannah         IT    4000
13     Mia         IT    7500
16    Paul         IT    8000
20     Tom         IT    5000
24  Xander         IT    7000

In [4]:
b=df.loc[df['department']=='IT','name']
print(b)

1       Jane
5      David
9     Hannah
13       Mia
16      Paul
20       Tom
24    Xander
Name: name, dtype: object

# Calculate total salary by department and sort by total salary in descending order

In [5]:
grouped_salaries=df.groupby('department')['salary'].sum().sort_values(ascending=False)
grouped_salaries

department
Sales    62000
HR       50500
IT       46500
Name: salary, dtype: int64

# Find out top 5 employee who are highly paid

In [6]:
df.sort_values(by= 'salary',ascending=False).head(5).reset_index(drop=True)

     name department  salary
0   David         IT    8000
1    Paul         IT    8000
2     Mia         IT    7500
3  Ursula         HR    7500
4    Jane         IT    7000

In [7]:
students = [
{"id": 1, "name": "Alice", "age": 20, "marks": 85},
{"id": 2, "name": "Bob", "age": 22, "marks": 75},
{"id": 3, "name": "Charlie", "age": 23, "marks": 45},
{"id": 4, "name": "David", "age": 21, "marks": 65},
{"id": 5, "name": "Eva", "age": 24, "marks": 90},
{"id": 6, "name": "Frank", "age": 25, "marks": 55},
{"id": 7, "name": "Grace", "age": 22, "marks": 72},
{"id": 8, "name": "Henry", "age": 23, "marks": 80},
{"id": 9, "name": "Ivy", "age": 21, "marks": 65},
{"id": 10, "name": "Jack", "age": 24, "marks": 95},
{"id": 11, "name": "Kenny", "age": 26, "marks": 50},
{"id": 12, "name": "Lily", "age": 25, "marks": 60},
{"id": 13, "name": "Mike", "age": 27, "marks": 48},
{"id": 14, "name": "Nina", "age": 28, "marks": 92},
{"id": 15, "name": "Oscar", "age": 29, "marks": 84},
{"id": 16, "name": "Paul", "age": 30, "marks": 79},
{"id": 17, "name": "Quinn", "age": 31, "marks": 71},
{"id": 18, "name": "Rachel", "age": 32, "marks": 66},
{"id": 19, "name": "Steve", "age": 33, "marks": 56},
{"id": 20, "name": "Tina", "age": 34, "marks": 60}
]

In [8]:
import pandas as pd 
st=pd.DataFrame(students).set_index('id')
st

       name  age  marks
id
1     Alice   20     85
2       Bob   22     75
3   Charlie   23     45
4     David   21     65
5       Eva   24     90
6     Frank   25     55
7     Grace   22     72
8     Henry   23     80
9       Ivy   21     65
10     Jack   24     95
11    Kenny   26     50
12     Lily   25     60
13     Mike   27     48
14     Nina   28     92
15    Oscar   29     84
16     Paul   30     79
17    Quinn   31     71
18   Rachel   32     66
19    Steve   33     56
20     Tina   34     60

In [9]:
def s(a):
    for x in a.index:
        if (a.loc[x,"marks"])>80:
            a.loc[x,'cat']='excelent'
        #print(x)
        elif ((a.loc[x,'marks']>=50)):
        #print(x)
            a.loc[x,'cat']='good'
        elif (a.loc[x,'marks'])<50:
        #print(x)
            a.loc[x,'cat']="Needs Improvement"

In [10]:
s(st)
print(st)

       name  age  marks                cat
id
1     Alice   20     85           excelent
2       Bob   22     75               good
3   Charlie   23     45  Needs Improvement
4     David   21     65               good
5       Eva   24     90           excelent
6     Frank   25     55               good
7     Grace   22     72               good
8     Henry   23     80               good
9       Ivy   21     65               good
10     Jack   24     95           excelent
11    Kenny   26     50               good
12     Lily   25     60               good
13     Mike   27     48  Needs Improvement
14     Nina   28     92           excelent
15    Oscar   29     84           excelent
16     Paul   30     79               good
17    Quinn   31     71               good
18   Rachel   32     66               good
19    Steve   33     56               good
20     Tina   34     60               good

In [11]:
columns=['name','department','age','salary','joining_date','created_date','last_updated_timestamp','rating','experience_years','bonus','project_count']
d=pd.read_csv("E:\DE\employee_data.csv",sep='~',usecols=columns)
#.set_index('id')
d

,name,age,salary,joining_date,department,rating,experience_years,bonus,project_count,created_date,last_updated_timestamp
0,Alice,50.0,118925.875299,2023-01-01,Finance,2.995399,26,5000.0,7,2023-01-01,2023-01-01 08:00:00
1,Bob,NaN,99891.929595,2023-01-08,IT,1.692691,13,5000.0,6,2023-01-02,2023-01-01 20:00:00
2,Charlie,NaN,NaN,2023-01-15,Sales,4.389090,19,5000.0,9,2023-01-03,2023-01-02 08:00:00
3,Diana,31.0,101317.014661,2023-01-22,Marketing,3.179797,21,NaN,8,2023-01-04,2023-01-02 20:00:00
4,Ethan,52.0,119926.309095,2023-01-29,Marketing,4.958121,18,NaN,9,2023-01-05,2023-01-03 08:00:00
5,Fiona,33.0,45995.785884,2023-02-05,IT,3.749584,7,10000.0,5,2023-01-06,2023-01-03 20:00:00
6,George,58.0,NaN,2023-02-12,Sales,2.431404,37,10000.0,5,2023-01-07,2023-01-04 08:00:00
7,Hannah,54.0,62316.571565,2023-02-19,Finance,3.288137,37,10000.0,0,NaN,2023-01-04 20:00:00
8,Ian,21.0,48955.605573,2023-02-26,Finance,1.840792,22,5000.0,9,2023-01-09,2023-01-05 08:00:00
9,Julia,NaN,111165.739614,2023-03-05,HR,2.361121,6,10000.0,5,2023-01-10,2023-01-05 20:00:00
10,Kevin,51.0,50260.076467,2023-03-12,Finance,4.870724,30,10000.0,4,2023-01-11,2023-01-06 08:00:00
11,Laura,33.0,80335.671989,2023-03-19,Sales,1.705210,38,5000.0,4,2023-01-12,2023-01-06 20:00:00
12,Michael,58.0,111361.778563,NaN,Sales,3.421635,34,NaN,7,NaN,NaN
13,Nina,27.0,NaN,2023-04-02,IT,3.582679,22,10000.0,6,2023-01-14,2023-01-07 20:00:00
14,Oliver,NaN,65251.109842,2023-04-09,HR,1.140984,12,NaN,7,2023-01-15,NaN
15,Paula,NaN,77309.942757,2023-04-16,Finance,4.540364,35,NaN,5,2023-01-16,2023-01-08 20:00:00
16,Quincy,36.0,91754.663139,2023-04-23,IT,4.859996,0,10000.0,2,2023-01-17,2023-01-09 08:00:00
17,Rachel,21.0,44930.138357,2023-04-30,Sales,2.627156,39,5000.0,9,2023-01-18,2023-01-09 20:00:00
18,Steve,51.0,75899.002743,2023-05-07,HR,1.736867,3,NaN,3,2023-01-19,2023-01-10 08:00:00
19,Tina,18.0,93062.352696,2023-05-14,IT,1.736889,10,10000.0,5,2023-01-20,2023-01-10 20:00:00
20,Uma,20.0,87046.594589,2023-05-21,IT,2.712561,28,5000.0,8,2023-01-21,2023-01-11 08:00:00
21,Victor,54.0,NaN,2023-05-28,Finance,3.308732,0,5000.0,4,2023-01-22,2023-01-11 20:00:00
22,Wendy,42.0,NaN,2023-06-04,Sales,3.768433,38,10000.0,4,2023-01-23,2023-01-12 08:00:00
23,Xander,NaN,NaN,NaN,IT,4.343362,0,NaN,7,2023-01-24,2023-01-12 20:00:00
24,Yara,55.0,56610.867092,2023-06-18,Sales,2.999929,28,5000.0,4,2023-01-25,2023-01-13 08:00:00
25,Zane,31.0,44148.701233,2023-06-25,Finance,4.824813,34,10000.0,1,2023-01-26,2023-01-13 20:00:00
26,Abigail,33.0,111992.878403,2023-07-02,Marketing,3.008952,15,NaN,2,2023-01-27,2023-01-14 08:00:00
27,Ben,22.0,67169.417715,2023-07-09,HR,4.545915,18,NaN,0,2023-01-28,NaN
28,Catherine,51.0,44479.513918,2023-07-16,Finance,2.649537,21,10000.0,4,2023-01-29,2023-01-15 08:00:00
29,David,25.0,NaN,2023-07-23,IT,2.186011,24,NaN,9,2023-01-30,2023-01-15 20:00:00
30,Ella,NaN,97216.827550,NaN,Marketing,1.395891,24,5000.0,1,2023-01-31,2023-01-16 08:00:00
31,Frank,41.0,49922.680232,2023-08-06,Sales,3.297572,38,5000.0,1,2023-02-01,2023-01-16 20:00:00
32,Grace,43.0,62274.116032,2023-08-13,Sales,1.478369,37,NaN,3,2023-02-02,2023-01-17 08:00:00
33,Henry,33.0,95822.980917,2023-08-20,IT,4.350482,29,5000.0,9,2023-02-03,2023-01-17 20:00:00
34,Ivy,28.0,38393.420341,2023-08-27,Sales,2.472457,9,NaN,1,2023-02-04,2023-01-18 08:00:00
35,Jack,43.0,96091.071087,NaN,Sales,4.236410,29,5000.0,4,2023-02-05,2023-01-18 20:00:00
36,Katie,35.0,47760.716837,NaN,IT,3.197777,34,5000.0,8,2023-02-06,2023-01-19 08:00:00
37,Liam,NaN,83472.587685,2023-09-17,IT,1.409333,0,NaN,2,2023-02-07,2023-01-19 20:00:00
38,Mona,41.0,NaN,2023-09-24,IT,4.383594,38,5000.0,9,2023-02-08,NaN
39,Nathan,43.0,58448.903037,2023-10-01,Marketing,2.303388,30,NaN,1,2023-02-09,NaN
40,Olivia,NaN,72554.368074,2023-10-08,Sales,2.717866,16,NaN,1,NaN,2023-01-21 08:00:00
41,Peter,19.0,45205.666301,2023-10-15,IT,3.081404,34,NaN,0,2023-02-11,2023-01-21 20:00:00
42,Queen,NaN,48977.376884,2023-10-22,Finance,4.054101,9,5000.0,9,2023-02-12,2023-01-22 08:00:00
43,Robert,50.0,110025.081027,2023-10-29,Marketing,3.575024,27,10000.0,9,NaN,2023-01-22 20:00:00
44,Sophia,44.0,72967.071602,2023-11-05,Finance,1.312079,35,5000.0,5,2023-02-14,2023-01-23 08:00:00
45,Thomas,36.0,73561.119189,2023-11-12,Marketing,4.545694,12,5000.0,0,NaN,2023-01-23 20:00:00
46,Ursula,18.0,30511.798672,2023-11-19,Sales,1.324086,36,10000.0,1,2023-02-16,2023-01-24 08:00:00
47,Vera,31.0,92230.172676,2023-11-26,Sales,3.549378,27,5000.0,8,2023-02-17,2023-01-24 20:00:00
48,William,59.0,NaN,2023-12-03,Sales,2.148778,31,10000.0,8,2023-02-18,2023-01-25 08:00:00
49,Zara,26.0,NaN,2023-12-10,IT,3.369178,14,NaN,9,2023-02-19,2023-01-25 20:00:00

In [12]:
#string to appropriate data types

dtypes1 = {
   
    'name':str,
    'age': int ,
    'salary': float,
    'department':str,
    'rating': float,
    'experience_years':int,
    'bonus': float,
    'project_count':int, 
    
}

In [14]:
#string to appropriate data types
d=d.astype(dtypes1)

IntCastingNaNError: Cannot convert non-finite values (NA or inf) to integer

In [15]:
# string to datetime 
d['joining_date']=pd.to_datetime(d['joining_date'])
d['created_date']=pd.to_datetime(d['created_date'])
d['last_updated_timestamp']=pd.to_datetime(d['last_updated_timestamp'])

In [ ]:
d.dtypes

In [ ]:
#Handling missing values, replace missing values in columns

d['age']=d['age'].fillna(0)
d['salary']=d['salary'].fillna(0)
d['joining_date']=d['joining_date'].fillna('1900-01-01')
d['bonus']=d['bonus'].fillna(0)
d['created_date']=d['created_date'].fillna('1900-01-01')
d['last_updated_timestamp']=d['last_updated_timestamp'].fillna('1900-01-01 00:00:00')

In [ ]:
pip install sqlalchemy
pip install psycopg2

In [ ]:
from sqlalchemy import create_engine
# Note: 'postgresql://username:password@localhost:5432/your_database'

engine_string ='postgresql://postgres:admin@localhost:5432/monjur'
engine = create_engine(engine_string)

In [ ]:
d.to_sql('employee_data', engine, if_exists='replace', index=True)